Revit 2026 API
DirectShape.SetShape Method
Overload List
Name | Description
SetShape(IList<GeometryObject>)
SetShape(ShapeBuilder) |  Sets the shape of this object to the one accumulated in the supplied Builder object. If the new shape is identical to the old one, the old shape will be kept.
SetShape(IList<GeometryObject>, DirectShapeTargetViewType)
Top
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace